src/cf/Catalogs/ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента</Name>
			<Comment>Настройки выгрузки/загрузки данных, имя объекта сохранено в связи с динамическим созданием прав и правил префиксации</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантИспользованияНастройки</Name>
					<Comment>Определяет предназначение настройки: загрузка или выгрузка</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ор_ВариантыИспользованияНастройки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрикладногоОбъекта</Name>
					<Comment>Справочник, Документ</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ор_ТипыПрикладныхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПрикладногоОбъекта</Name>
					<Comment>Имя документа, как оно указанно в метаданных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТабличнойЧасти</Name>
					<Comment>Имя табличной части, как оно указанно в метаданных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПрикладногоОбъекта</Name>
					<Comment>Представление документа, справочника, для отображения пользователю</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеТабличнойЧасти</Name>
					<Comment>Имя табличной части, для отображения пользователю</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиЗагрузкиВыгрузки</Name>
					<Comment>Настройки загрузки</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретСозданияНовыхЭлементов</Name>
					<Comment>Флаг Не создавать новых элементов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
					<Comment>Контрагенты</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Настройка доступна для указанных контрагентов</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ПараметрОтборПоВариантуИспользования) Тогда
		
		// Установим отбор по варианту использования настройки
		ВариантИспользованияНастройки = Параметры.ПараметрОтборПоВариантуИспользования;
		
		// Установим текущую группу справочника
		ор_ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.УстановитьТекущуюГруппуСправочника(Параметры, Элементы.Список);
		
		Если ЗначениеЗаполнено(Параметры.ПараметрОтборПоТипуПрикладногоОбъекта) Тогда
			
			// Установим отбор по типу прикладного объекта
			ТипПрикладногоОбъекта = Параметры.ПараметрОтборПоТипуПрикладногоОбъекта;
			
			// ПараметрОтборПоМетаданным содержит полное имя метаданного
			Если ЗначениеЗаполнено(Параметры.ПараметрОтборПоМетаданным) Тогда
				
				ОтборПоМетаданным = Метаданные.НайтиПоПолномуИмени(Параметры.ПараметрОтборПоМетаданным);
				
				// Установим отбор по метаданным объекта
				ИмяПрикладногоОбъекта = ОтборПоМетаданным.Имя;
				
				// ПараметрОтборПоМетаданнымТабличнойЧасти содержит имя ТЧ
				Если ЗначениеЗаполнено(Параметры.ПараметрОтборПоМетаданнымТабличнойЧасти) Тогда
					
					// Проверим принадлежность ТЧ объекту
					Если НЕ ОтборПоМетаданным.ТабличныеЧасти.Найти(Параметры.ПараметрОтборПоМетаданнымТабличнойЧасти)=Неопределено Тогда
						
						// Установим отбор по ТЧ
						ИмяТабличнойЧасти = Параметры.ПараметрОтборПоМетаданнымТабличнойЧасти;
						
					КонецЕсли;
					
				КонецЕсли
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Установим отбор по контрагенту
	Если ЗначениеЗаполнено(Параметры.ПараметрОтборПоКонтрагенту) Тогда
		Контрагент = Параметры.ПараметрОтборПоКонтрагенту;
	КонецЕсли;
	
	УстановитьОтборДинамическихСписковПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// В веб-клиенте редактирование справочника запрещено
	#Если ВебКлиент Тогда
		ТолькоПросмотр = Истина;
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	УстановитьОтборДинамическихСписковПриИзмененииКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборДинамическихСписковПриИзмененииКлиент()
	
	УстановитьОтборДинамическихСписковПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическихСписковПриИзмененииСервер()
	
	УстановитьОтборДинамическихСписков("ВариантИспользованияНастройки", ВариантИспользованияНастройки);
	УстановитьОтборДинамическихСписков("ТипПрикладногоОбъекта"        , ТипПрикладногоОбъекта);
	УстановитьОтборДинамическихСписков("ИмяПрикладногоОбъекта"        , ИмяПрикладногоОбъекта);
	УстановитьОтборДинамическихСписков("ИмяТабличнойЧасти"            , ИмяТабличнойЧасти);
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		МассивПоКонтрагенту      = КритерииОтбора.ор_НастройкиКонтрагентов.Найти(Контрагент);
		МассивПоВсемКонтрагентам = ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьНастройкиДляВсехКонтрагентов();
		
		Для Каждого ЭлементПоКонтрагенту Из МассивПоКонтрагенту Цикл
			МассивПоВсемКонтрагентам.Добавить(ЭлементПоКонтрагенту);
		КонецЦикла;
		
		УстановитьОтборДинамическихСписков("Ссылка", МассивПоВсемКонтрагентам);
		
	Иначе
		УстановитьОтборДинамическихСписков("Ссылка", Неопределено);
	КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает отбор динамических списков формы.
//
&НаСервере
Процедура УстановитьОтборДинамическихСписков(ИмяРеквизита, ЗначениеРеквизита)
	
	Если ИмяРеквизита="Ссылка" Тогда
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке;
	Иначе
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		ИмяРеквизита,
		ЗначениеРеквизита,
		ВидСравненияОтбора,,
		ЗначениеЗаполнено(ЗначениеРеквизита));
	
КонецПроцедуры

#КонецОбласти
